{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"John Doe","url":""},"pages":[{"title":"about","date":"2017-09-13T04:21:24.000Z","updated":"2017-09-13T04:21:24.483Z","comments":true,"path":"about/index.html","permalink":"/about/index.html","excerpt":"","text":""}],"posts":[{"title":"CopyRight","slug":"copyright","date":"2017-09-07T08:46:25.000Z","updated":"2017-09-13T04:28:14.041Z","comments":true,"path":"2017/09/07/copyright/","link":"","permalink":"/2017/09/07/copyright/","excerpt":"","text":"I’m only a student and will graduate after two years. all the post here aim to track learning progress. And they are demonstrates for my projects in my resume, irrelevant to business. I would comply with the rules about IT, and all the quote would mark out the source. I enjoy being geek and focus on the ideas behind the code. Of course, i will participate in open source projects in future All articles here are original!","categories":[],"tags":[]},{"title":"Mavproxy, Dronekit And Mission Planner","slug":"relationmavproxy","date":"2017-09-07T08:46:25.000Z","updated":"2017-09-13T03:10:38.138Z","comments":true,"path":"2017/09/07/relationmavproxy/","link":"","permalink":"/2017/09/07/relationmavproxy/","excerpt":"","text":"I：The Relation Between Mavproxy and DronekitI would like to list out some materials before begining, which are all from dronkit. This topic explains how to set up and run DroneKit-Python (within MAVProxy) on the different host operating systems and then run a basic DroneKit app. The remaining dependencies (including MAVProxy), are installed when you get DroneKit-Python from the public PyPi repository: Install DroneKit-Python and its remaining dependencies (including MAVProxy) from the public PyPi repository: To install DroneKit-Python using the installer: Download and run the latest MAVProxy installer — accept all prompts. Download and run the latest DroneKit installer — accept all prompts (install in the same location as MAVProxy). Before executing DroneKit scripts you must first start MAVProxy and connect to your autopilot (simulated or real). The connection to the vehicle can be set up on the command line when starting MAVProxy or after MAVProxy is running. Then, some important information following reveal the relation between them. DroneKit is implemented as a MAVProxy module (MAVProxy is installed automatically with DroneKit). The best way to load the DroneKit module into MAVProxy is to add it to the startup script (mavinit.scr). Alternatively you can choose to manually (re)load DroneKit into MAVProxy every time you need it:123MANUAL&gt; module load droneapi.module.apiDroneAPI loadedMANUAL&gt; So, simple put, the dronkit is one of module of Maxproxy.It’s time to see what’s the meaning of this. It sounds like the module of linux. MAVProxy can be extended with modules. These run in parallel threads to the main MAVProxy program in order to maintain overall stability.Modules can include such things as GUI elements and diagnostic and monitoring applications. This problem has been solved, go on with our work. NOTE: I made some mistakes that the above text is from dronekit whose version is 1.5.X. whereas it is independent of Marproxy after 2.0.X. II: Compare Mavproxy and Misson PlannerI search this question on the websites but get nothing except stackoverflow, maybe it’s a strange quetion. I find there is cooperation relation between mavproxy and misson plannner. And most pepole want to use mavproxy to control the UAV, meanwile, observe the data from autopilot in misson planner. I will do some basic experiments to compare the latency in next post. III: The Interface Between Matlab And Pyhon. To call Python functions from MATLAB The above context is from cpython. To call Matlab functions from PythonThe above context is from matlab. On the surface, it’s very convenient to call each other. But, just look easy, hard to do. I will have a try next post.","categories":[],"tags":[]},{"title":"Hardware Loop Experiment(continuing..)","slug":"interaction","date":"2017-09-07T08:46:25.000Z","updated":"2017-09-13T03:06:42.668Z","comments":true,"path":"2017/09/07/interaction/","link":"","permalink":"/2017/09/07/interaction/","excerpt":"","text":"I : Closed Loop ExperimentBefore start, i recommend this gitter talk for a quick overview. Due to the lack of basic knowlegae of Mavlink, something is not easy for me. I should compose myself and relax a while to make the complex issues simple. Frist, i have a idea that the pixhawk2 send mavlink messgaes to GSC via 3DR radios while receving the messgaes by companion computer via UART. We should analyses it’s dismerits and merits. Obviously, the latency of connect via UART is lower than that via RF-link. But we have to use 2nd RF radio to connect between GSC and pixhawk. Actually, we hope the companion computer ( such as edison) can relay the STATUS messgaes to GCS. So, i just compromise myself in some respects. Referring to helicopter, i have quickly completed the connection. it’s worth to make efforts to highlight something. When arming, the messgaes “Prearm : motor interlock enabled” appears. And i puzzled for over this problem as i don’t use motor interlock feature. Then, i ask for help in official discussion forum ：ardupilot. But i get nothing until now. Finally, i find a way to solve this prolem. Set CH8_OPT 32 Set ARM_CHECK 0 Keep the CH8 swith off when arming. Keep the CH8 swith on after armed to make motor spin. NOTE:During this process, i have tried to modify the code in AP_ARMING.cpp and comment lines relative to motor interlock. Although the messgaes above disapper, i encounter some new problem, such as “prearm: check firmware…”. If you have tracked the code, you would kenow new problem is caused by old problem. Due to the lack of some electirc componet such as a transverter, which translate PWM to PPM, i haven’t verify the whole system. Aimming to simplify the system. i divide the work into two parts. First, i will connect pixhawk2 and heilcopter without FBL to complete whole system. Second, mounting FBL to Helicopter make a system composed by autopilot and FBL. 1.1 Hardware Loop without FBL","categories":[],"tags":[]}]}